In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv('data.csv')

In [ ]:
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [ ]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [ ]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [ ]:
##handling missing values
df.tail(5).isnull()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,False,False,False,False,False,False,False,False,False
236,False,False,False,False,False,False,False,False,False
237,False,False,False,False,False,False,False,False,False
238,False,False,False,False,False,False,False,False,False
239,False,False,False,False,False,False,False,False,False

In [ ]:
df.isnull().any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
235    False
236    False
237    False
238    False
239    False
Length: 240, dtype: bool

In [ ]:
df_filled=df.fillna(0)

In [ ]:
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [ ]:
### renaming columns
df=df.rename(columns={'Date':'Tarik'})
df.head(5)

,Transaction ID,Tarik,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [ ]:
##change data types
df['Units_Sold']=df['Units Sold'].astype(float)
df.head(5)

,Transaction ID,Tarik,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method,Units_Sold
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card,2.0
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal,1.0
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card,3.0
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card,4.0
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal,1.0

In [ ]:
df.dtypes

Transaction ID        int64
Tarik                object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
Units_Sold          float64
dtype: object

In [ ]:
df['new_UP']=df['Unit Price'].apply(lambda x:x*2)
df.tail(4)

,Transaction ID,Tarik,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method,Units_Sold,new_UP
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card,3.0,180.00
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card,3.0,21.98
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal,1.0,110.00
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card,2.0,59.98

In [ ]:
###data aggregating and grouping
df.head

<bound method NDFrame.head of      Transaction ID       Tarik Product Category  \
0             10001  2024-01-01      Electronics
1             10002  2024-01-02  Home Appliances
2             10003  2024-01-03         Clothing
3             10004  2024-01-04            Books
4             10005  2024-01-05  Beauty Products
..              ...         ...              ...
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
0                                      iPhone 14 Pro           2      999.99
1                                   Dyson V11 Vacuum           1      499.99
2                                   Levi's 501 Jeans           3       69.99
3                                  The Da Vinci Code           4       15.99
4                            Neutrogena Skincare Set           1       89.99
..                                               ...         ...         ...
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method  Units_Sold   new_UP
0          1999.98  North America    Credit Card         2.0  1999.98
1           499.99         Europe         PayPal         1.0   999.98
2           209.97           Asia     Debit Card         3.0   139.98
3            63.96  North America    Credit Card         4.0    31.98
4            89.99         Europe         PayPal         1.0   179.98
..             ...            ...            ...         ...      ...
235         159.99         Europe         PayPal         1.0   319.98
236         270.00           Asia     Debit Card         3.0   180.00
237          32.97  North America    Credit Card         3.0    21.98
238          55.00         Europe         PayPal         1.0   110.00
239          59.98           Asia    Credit Card         2.0    59.98

[240 rows x 11 columns]>

In [ ]:
g_mean=df.groupby('Product Category')['Total Revenue'].mean()
print(g_mean)

Product Category
Beauty Products     65.54750
Books               46.54825
Clothing           203.22325
Electronics        874.56025
Home Appliances    466.15400
Sports             358.16300
Name: Total Revenue, dtype: float64

In [ ]:
pip install lxml

Collecting lxml
  Downloading lxml-6.0.2-cp314-cp314-win_amd64.whl.metadata (3.7 kB)
Downloading lxml-6.0.2-cp314-cp314-win_amd64.whl (4.1 MB)
   ---------------------------------------- 0.0/4.1 MB ? eta -:--:--
   ---------------------------------------- 0.0/4.1 MB ? eta -:--:--
   -- ------------------------------------- 0.3/4.1 MB ? eta -:--:--
   -- ------------------------------------- 0.3/4.1 MB ? eta -:--:--
   ----- ---------------------------------- 0.5/4.1 MB 644.4 kB/s eta 0:00:06
   ----- ---------------------------------- 0.5/4.1 MB 644.4 kB/s eta 0:00:06
   ------- -------------------------------- 0.8/4.1 MB 718.0 kB/s eta 0:00:05
   ------- -------------------------------- 0.8/4.1 MB 718.0 kB/s eta 0:00:05
   ---------- ----------------------------- 1.0/4.1 MB 622.6 kB/s eta 0:00:05
   ---------- ----------------------------- 1.0/4.1 MB 622.6 kB/s eta 0:00:05
   ---------- ----------------------------- 1.0/4.1 MB 622.6 kB/s eta 0:00:05
   ---------- ----------------------------- 1.0/4.1 MB 622.6 kB/s eta 0:00:05
   ------------ --------------------------- 1.3/4.1 MB 515.4 kB/s eta 0:00:06
   ------------ --------------------------- 1.3/4.1 MB 515.4 kB/s eta 0:00:06
   ------------ --------------------------- 1.3/4.1 MB 515.4 kB/s eta 0:00:06
   --------------- ------------------------ 1.6/4.1 MB 496.4 kB/s eta 0:00:06
   --------------- ------------------------ 1.6/4.1 MB 496.4 kB/s eta 0:00:06
   --------------- ------------------------ 1.6/4.1 MB 496.4 kB/s eta 0:00:06
   --------------- ------------------------ 1.6/4.1 MB 496.4 kB/s eta 0:00:06
   --------------- ------------------------ 1.6/4.1 MB 496.4 kB/s eta 0:00:06
   ----------------- ---------------------- 1.8/4.1 MB 426.5 kB/s eta 0:00:06
   ----------------- ---------------------- 1.8/4.1 MB 426.5 kB/s eta 0:00:06
   ----------------- ---------------------- 1.8/4.1 MB 426.5 kB/s eta 0:00:06
   -------------------- ------------------- 2.1/4.1 MB 427.6 kB/s eta 0:00:05
   -------------------- ------------------- 2.1/4.1 MB 427.6 kB/s eta 0:00:05
   -------------------- ------------------- 2.1/4.1 MB 427.6 kB/s eta 0:00:05
   ----------------------- ---------------- 2.4/4.1 MB 424.9 kB/s eta 0:00:05
   ----------------------- ---------------- 2.4/4.1 MB 424.9 kB/s eta 0:00:05
   ----------------------- ---------------- 2.4/4.1 MB 424.9 kB/s eta 0:00:05
   ------------------------- -------------- 2.6/4.1 MB 431.5 kB/s eta 0:00:04
   ------------------------- -------------- 2.6/4.1 MB 431.5 kB/s eta 0:00:04
   ---------------------------- ----------- 2.9/4.1 MB 439.6 kB/s eta 0:00:03
   ---------------------------- ----------- 2.9/4.1 MB 439.6 kB/s eta 0:00:03
   ------------------------------ --------- 3.1/4.1 MB 448.9 kB/s eta 0:00:03
   ------------------------------ --------- 3.1/4.1 MB 448.9 kB/s eta 0:00:03
   ------------------------------ --------- 3.1/4.1 MB 448.9 kB/s eta 0:00:03
   --------------------------------- ------ 3.4/4.1 MB 458.8 kB/s eta 0:00:02
   --------------------------------- ------ 3.4/4.1 MB 458.8 kB/s eta 0:00:02
   --------------------------------- ------ 3.4/4.1 MB 458.8 kB/s eta 0:00:02
   ----------------------------------- ---- 3.7/4.1 MB 454.8 kB/s eta 0:00:01
   ----------------------------------- ---- 3.7/4.1 MB 454.8 kB/s eta 0:00:01
   ----------------------------------- ---- 3.7/4.1 MB 454.8 kB/s eta 0:00:01
   -------------------------------------- - 3.9/4.1 MB 450.4 kB/s eta 0:00:01
   -------------------------------------- - 3.9/4.1 MB 450.4 kB/s eta 0:00:01
   ---------------------------------------- 4.1/4.1 MB 439.8 kB/s  0:00:09
Installing collected packages: lxml
Successfully installed lxml-6.0.2
Note: you may need to restart the kernel to use updated packages.

In [ ]:

url="https://www.fdic.gov/bank/individual/failed/banklist.html"
df=pd.read_html(url)

AttributeError: 'list' object has no attribute 'head'